import { type Product } from '../types';

export const products: Product[] = [
  {
    id: 1,
    name: "Минималистичный диван",
    category: "Диваны",
    price: 1200,
    description: "Стильный диван с низким профилем, созданный для современных гостиных.",
    material: "Премиальная шерстяная смесь, каркас из массива дуба",
    specs: "Ш: 220см, В: 75см, Г: 95см"
  },
  {
    id: 2,
    name: "Ортопедический матрас",
    category: "Матрасы",
    price: 850,
    description: "Разработан для максимальной поддержки позвоночника и комфортного сна.",
    material: "Натуральный латекс, независимые пружины",
    specs: "200см x 160см x 25см"
  },
  {
    id: 3,
    name: "Кресло для отдыха",
    category: "Кресла",
    price: 550,
    description: "Идеальное место для чтения или отдыха в минималистичном дизайне.",
    material: "Натуральная кожа, сталь с порошковым покрытием",
    specs: "Ш: 80см, В: 85см, Г: 85см"
  },
  {
    id: 4,
    name: "Скандинавская скамья",
    category: "Диваны",
    price: 400,
    description: "Универсальное решение для сидения с чистыми линиями и натуральной отделкой.",
    material: "Ясень",
    specs: "Ш: 140см, В: 45см, Г: 40см"
  },
  {
    id: 5,
    name: "Кровать Cloud",
    category: "Матрасы",
    price: 1500,
    description: "Почувствуйте сон на облаке с нашим матрасом повышенной мягкости.",
    material: "Пена с эффектом памяти, бамбуковая ткань",
    specs: "200см x 180см x 30см"
  },
  {
    id: 6,
    name: "Бархатное кресло",
    category: "Кресла",
    price: 650,
    description: "Добавьте роскоши в ваш интерьер с этим глубоким бархатным креслом.",
    material: "Итальянский бархат, ножки из ореха",
    specs: "Ш: 75см, В: 90см, Г: 80см"
  },
  {
    id: 7,
    name: "Модульная секция",
    category: "Диваны",
    price: 2200,
    description: "Адаптируемая мебель, которая растет вместе с вашими потребностями.",
    material: "Лен, массив сосны",
    specs: "Индивидуальные размеры"
  },
  {
    id: 8,
    name: "Жесткое основание",
    category: "Матрасы",
    price: 900,
    description: "Долговечное и жесткое основание для десятилетий крепкого сна.",
    material: "Пена высокой плотности",
    specs: "200см x 160см x 20см"
  }
];
